In [1]:
%pip install pandas

Collecting pandas
  Using cached pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in d:\data_analyst_bootcamp\myenv\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\data_analyst_bootcamp\myenv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in d:\data_analyst_bootcamp\myenv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2

**Pandas-DataFrame And Series**

What is Pandas?

- Pandas is a Python library used for working with structured data. It makes it easy to analyze, clean, explore, and manipulate data.

Key Concepts:

- Series: A one-dimensional labeled array (like a column).

    Example:
    pd.Series([1, 2, 3])

- DataFrame: A two-dimensional labeled data structure with rows and columns (like an Excel sheet).

    Example:
    pd.DataFrame({'Name': ['Tom', 'Jerry'], 'Age': [28, 22]})

In [ ]:
import pandas as pd

#creating series through list
data=[1,2,3,4]
series=pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
#creating series through dictionary
series = pd.Series({'a': 1, 'b': 2, 'c':3})
print(series)

a    1
b    2
c    3
dtype: int64

In [6]:
#creating series with different index
data=[3,4,5]
ind=['a','b','c']
print(pd.Series(data,index=ind))

a    3
b    4
c    5
dtype: int64

**DataFrame creation**

In [7]:
#creating frames from a dictionary of list
data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [34]:
#creating frame with different indexes
df = pd.DataFrame({
    'Name': ['Aditya', 'Riya', 'Rahul'],
    'Marks': [90, 85, 88]
}, index=['a', 'b', 'c'])

print(df)

     Name  Marks
a  Aditya     90
b    Riya     85
c   Rahul     88

**Accessing data from dataframe**

In [35]:
#Accessing particular column only
print(df['Name'])
print(type(df['Name']))

a    Aditya
b      Riya
c     Rahul
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
#Access by loc 
print(df.loc['a'],'\n') # Row with label 'a'
print(df.loc['b']['Marks'],'\n')  # Specific value at row 'b', column 'Marks'
print(df.loc['a':'b']) # Inclusive slice → includes both 'a' and 'b'

Name     Aditya
Marks        90
Name: a, dtype: object

85

     Name  Marks
a  Aditya     90
b    Riya     85

In [ ]:
# Access by index
print(df.iloc[0],'\n')# First row (index 0)
print(df.iloc[1, 1],'\n') # Value at row 1, column 1 → 85
print(df.iloc[0:2]) # Slice rows 0 to 1 (excludes index 2)

Name     Aditya
Marks        90
Name: a, dtype: object

85

     Name  Marks
a  Aditya     90
b    Riya     85

In [55]:
#access specific element by at
print(df.at['a','Name'])

#access specific element by iat
print(df.iat[1,1])

Aditya
85

In [58]:
#create a data frame from list of dictionary
data=[
    {'name':'Aditya','age':18,'state':'UP'},
    {'name':'Rahul','age':20,'state':'bihar'},
    {'name':'Ajay','age':19,'state':'gujarat'}
]
df=pd.DataFrame(data)
print(df)

     name  age    state
0  Aditya   18       UP
1   Rahul   20    bihar
2    Ajay   19  gujarat

**data manipulation with dataframe**

In [62]:
#adding a column
df['salary']=[100,200,300] 
print(df)

     name  age    state  salary
0  Aditya   18       UP     100
1   Rahul   20    bihar     200
2    Ajay   19  gujarat     300

In [67]:
#removing a column
#axis=1: check salary in column, axis=0(default): check salary in row
df.drop('salary',axis=1) #it will not delete salary column permanently

     name  age    state
0  Aditya   18       UP
1   Rahul   20    bihar
2    Ajay   19  gujarat

In [69]:
print(df)

     name  age    state  salary
0  Aditya   18       UP     100
1   Rahul   20    bihar     200
2    Ajay   19  gujarat     300

In [70]:
df.drop('salary', axis=1, inplace=True) #it will delete salary column permanently

In [71]:
print(df)

     name  age    state
0  Aditya   18       UP
1   Rahul   20    bihar
2    Ajay   19  gujarat

In [83]:
#Add age to column
df['age']=df['age']+1
print(df)

     name  age    state
0  Aditya   19       UP
1   Rahul   21    bihar
2    Ajay   20  gujarat

**Methods of data frame**

head() and tail():
Returns the first 5 rows and last 5 rows by default.

head(5) and tail(5):
Returns the first 5 rows and last 5 row explicitly, because you passed 5 as an argument.

In [4]:
import pandas as pd
df1=pd.read_csv('sales_data.csv')
df1.head(5) #for getting top five records

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [89]:
df1.tail(5) #for getting last five records

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [90]:
# Display the data types of each column
print("Data types:\n", df1.dtypes)

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [5]:
# Summary statistics for numeric columns
print("Statistical summary:\n", df1.describe())

Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [11]:
 # (rows, columns)
print(df1.shape)

(240, 9)